{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=NQ2F08N7MfGPjA-kadCvhw",
  "author": "Carolyn Z.",
  "description": "Le bf and I both LOVED this place. \n\nWe ordered:\n1. Side of meatballs (served with really yummy bread) $12\n2. Margherita Pizza Small $20\n3. The Kanoute Small $20\n\nWe made reservations and glad that we did because about 20 minutes into our meal, people starting waiting 30+ minutes for a seat at the bar. \n\nEverything we ordered was good. The meatballs were good, but the real standout was the bread that came with it that you could dip in the sauce. We quickly finished our two slices, and when we mentioned how good it was, the server was nice enough to bring us 2 more slices, and also a dish of olive oil. That was standout service right there.\n\nThe pizzas were pretty sizable for being small. Each pizza was split into 6 slices. We managed to finish the meatballs, but ended up taking about 8 slices of pizza home. Both were very, very tasty. I'm not normally a vegetable person, but the Kanoute was pretty good with the arugula on top. The Margherita was also very yummy. There was a lot of cheese string action going on. The food all came out super hot. \n\nIf you don't want to wait in line, or just want really good pizza, you can also call your order ahead for pickup or use one of those food delivery apps. We saw a ton of pizzas go out the door in that way. The service throughout our dinner was top notch, even when things got busy.\n\nThis is a super solid spot. There aren't a lot of seats, so get there earlier, make reservations or get delivery. We will both be back very soon for more excellent food. And shout out to FRANK for being so welcoming and awesome!",
  "datePublished": "2017-09-24",
  "ratingValue": 5
}