{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=k2aYjzcdXsmzkJalLGa4qQ",
  "author": "Michael Z.",
  "description": "I can see how this place is 5 stars on Yelp, but I'm going to have to disagree a little bit with the community on this one. I came here with a friend on a strong recommendation, and after reading the reviews, I arrived eager to have some delicious Italian food. The place itself is quite small, with only a few small tables and bar seating (maybe ~20 people max), so I would definitely suggest that you make a reservation if you want to come during dinnertime. It's quite nice and friendly inside, though I found the partial sports bar feel (the TV was showing a baseball game) to go a bit weirdly with everything else, as the restaurant feels a bit nicer (maybe I have an internally biased conception of Italian food like this).\n\nWe weren't too hungry so we ordered the truffle bruschetta special and a small Guido pizza. A lot of reviews here hyped up the bruschetta, and it definitely delivered. I wholeheartedly agree that if they're offering it, you should get it. The bruschetta itself is baked just right--crunchy, but not too much so, and the truffle flavor is strong without being overpowering.\n\nMeanwhile, the Guido fell a bit short of expectations. To be fair, the expectations here were super high (the recommendation we got put this over SPQR, another Italian restaurant in SF that had a Michelin star), especially since the Guido in particular was a pizza that many other Yelpers enjoyed. So in this case, \"fell short\" still means it was pretty good, just not particularly mind-blowing. It wasn't the best thin-crust/artisanal pizza I've had by a decent margin. I found there to be a rather disappointing lack of tomato sauce, which made the overall flavor somewhat weak. The arugula/prosciutto/parmesan combination is fairly common in my view, and they didn't do anything that stood out. In fact, I actually thought that the spicy/hot (chili?) olive(?) oil that they provided with the pizza was the highlight of this part of the meal. It was probably the most unique oil I've ever used at an Italian restaurant, and it had this incredible hot but savory/aromatic element to it. The portion was pretty solid for 2 people, though truth be told, I could probably happily split a larger pizza too, especially if we were both hungry.\n\nAt $20 for a small pizza, it's a bit steep, but the pizzas are definitely made with high-quality ingredients and prepared nicely, so I would still say it's pretty worth it. To be honest, I'm not sure I would come back here if I lived nearby, but I would absolutely consider ordering delivery/carry-out, which I found to be a cool option, since I don't normally associate this type of pizza with the kind of stuff you can eat at home. Overall, pretty good, might go again, but not an unequivocal 5-star for me.",
  "datePublished": "2017-08-23",
  "ratingValue": 4
}