{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=j2F6xIe2XSXdFyj9TD7ebQ",
  "author": "Jonathan K.",
  "description": "This is one of those reviews I don't want to make, because I want to keep this gem all to myself. Living two blocks away, I found this place on Yelp and immediately had to try after seeing photos of their beautifully crafted pizzas.\n\nService:\nMy first time dining here was one of the most pleasant dining experiences I've had in SF. The place is so quaint and tucked away in a quiet neighborhood. My friend and I were not only attended by both of the incredibly helpful and friendly staff members. It was nice to see their teamwork!\n\nFood:\nThe flavors you get on this pizza are unbeatable. The Pink Onion Alarm Fire is truly amazing, so flavorful with the roasted red onion and garlic, and the perfect level of spice with pepperoni and the pizza being infused with chili oil! The crust, cheese, and sauce all tasted so fresh. The Pink Onion Salad was prepared very well and the house bread is high quality. They even gave us a free pasta on the house because our pizza had been taking \"too long\" (honestly we didn't even notice because we were enjoying the dining experience, delicious salad and bread so much) and the pesto pasta was cooked fabulously as well. \n\nI've returned 2 times since and will continue to return. I'm so glad to have such a pleasant and high quality pizza place in my neighborhood. My only critique will be that the cook of the crust can be inconsistent with some soggy patches. I'm not an expert on pizza cooking so I'm not sure if this could be resolved by a higher temperature surface or a more evenly distributed sauce. Nevertheless, I've rarely had more fresh and delicious flavors come together on a pizza before.",
  "datePublished": "2017-07-20",
  "ratingValue": 5
}