{
  "name": "Ffiona’s Restaurant",
  "address": "51 Kensington Church Street, London W8 4BA, United Kingdom",
  "longitude": -0.192783395566043,
  "latitude": 51.50405773515,
  "types": "British",
  "webpage": "ffionas.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/ffionas-restaurant-london",
  "ext_id": "212",
  "rev_url": "https://www.yelp.com/biz/ffionas-restaurant-london?hrid=dKXvLF-e0Q-zfKj0v_6vVA",
  "author": "Marc M.",
  "description": "I reserve 5 star Yelp reviews for those restaurants I would not hesitate to recommend or to go back to if given a chance.  My mother ate here twice in four days last year and recommended it to our family during our vacation to London this year.  We saved this meal for our last night and we all truly wish we would have eaten here earlier in the week just so we could eat there again!  The table next to us liked their meal so much that they made reservations for the following night.   \nIt is not a big place and it is only open 6pm-11pm - reservations are highly recommended/required. It is also not good for groups.  Anything more than a party of 6 might have an issue getting a table.\nThe food?  The menu says \"Probably the best Chicken KIev in the world\" and it is right.  If there is a better serving of this dish, I haven't had it.  Perfectly cooked chicken served in a sauce that deserves to be sopped up with bread.  Note that none of the entrees came with sides, so we recommend the chips (aka fries) and the spicy butternut squash.  My step-sons had the scottish sirloin steak and the swordfish.  My daughter had the homemade vegetable soup and avocado and pesto salad.  The desserts did not disappoint either: sticky toffee pudding, apple crumble and something I think called an Eaton - it was a meringue with strawberries.\nThe are quite a few mixed cocktails - and mocktails for the alcohol-adverse.\n\nOne of the highlights of the meal was the interaction with the owner and restaurant namesake: Ffiona.  FFiona splits time between the kitchen and the dining room.  She truly cares for each meal and diner.\n\nI can see why there are currently 175 Yelp reviews with a neat perfect rating.",
  "datePublished": "2018-06-09",
  "ratingValue": 5
}