{
  "name": "Ffiona’s Restaurant",
  "address": "51 Kensington Church Street, London W8 4BA, United Kingdom",
  "longitude": -0.192783395566043,
  "latitude": 51.50405773515,
  "types": "British",
  "webpage": "ffionas.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/ffionas-restaurant-london",
  "ext_id": "212",
  "rev_url": "https://www.yelp.com/biz/ffionas-restaurant-london?hrid=xbe9-IrH8qu9y_2Z_FMeDQ",
  "author": "Matamba A.",
  "description": "I never write reviews, but this is a special place.  If you are far away from home but want to feel as if you've suddenly walked into your favorite home town restaurant - this is the place.\n\nFirst on the food.  As has been stated in other reviews, this is wonderful British comfort food.   \n\nFor starters, we had the vegetable soup which was excellent.  It's made with all natural ingredients, but rather than tasting vegan and bland its incredibly flavorful.  Even more surprising, it's very substantial even though there are no heavy additives such as cream.\n\nMy wife had the lamb and I had the hake prepared in the style that they normally prepare the cod.  Again, both were excellent.  The lamb was prepared to the optimal temperature and was tender and moist.  The hake was perfectly seasoned.\n\nDo yourself a favor.  Suspend the diet and have dessert.  We splurged and had three - the sticky toffee, apple crumble and the lemon cheesecake.  We were scrapping the bottom of all 3 plates minutes later.  For hard core sweet tooth eaters like me, the sticky toffee is heaven.  The lemon cheesecake was made with a ginger snap crust.  If you like the graham cracker crust that typically comes with key lime pie - this crust takes it to a whole new level.  The apple crumble is for the folks that like medium to light sweet desserts.\n\nSecond, the service and atmosphere.  As amazing as the food is, this is actually the best part.  It's a small and cozy place that feels like a living room in your favorite relative's home.  \n\nFiona and her team are one of the most warm and caring groups that you'll find in a restaurant.  I'm not talking about insincere chit chat or cold professionalism.  They treat you like you just married their favorite sibling or cousin.  When you ask for recommendations, they don't just replace your preferences with theirs and tell you what they like or what is \"popular\".  They actually listen to your likes and dislikes and give you recommendations to help you have the best meal for you.  Most importantly, they really care if you like what you have.  \n\nEnjoy!",
  "datePublished": "2017-05-07",
  "ratingValue": 5
}