{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=gnHr14bkWS4_kRyif8031g",
  "author": "Cherylynn N.",
  "description": "On my way to work, I was listening to another installment of Second Date Update on Star 101.3. A guy called in asking for help in contacting a girl who had ghosted on him after their first date. He couldn't figure out why. The radio hosts call the girl up and she said, they went to a great sushi restaurant but then he shamed her food choices...saying that her cocktail contains too much sugar and that she should order sashimi instead of rolls because of carbs. \n\nWait, it gets better...\n\nHe then brings out a container from his cooler bag and asked the server to warm up his food for him (he doesn't have food allergies). \n\n( --____-- )\n\nI was surprised that the server didn't say, \"Get the f*ck outta here with your kale\".  Though, he/she probably thought that. \n\nIf the same dude saw me at Pink Onion I'm sure he would be judging me when I ordered carbs on carbs. More on that later...\n\nAfter a meeting, I was walking back to the office when I passed through Pink Onion (formerly Café Zazo). I've been eyeing the Pink Onion since they opened last month and was surprised to see that over 50 reviews had been filtered (what's up with that Yelp?). They had a sign outside advertising a $4 for a Slice of the Day so I decided to grab lunch at the bar.\n\nFor lunch, they have a daily changing menu with 4 options: salad ($10), panini ($10), pasta ($12.50), and slice of the day ($4). For dinner, they have a full menu with bruschetta, salad, several pasta options, and a variety of pizzas. Beer and wine only. \n\nI always like over ordering to sample different items and to have leftovers for latter so I ordered a slice of pizza and their pasta option for the day. Yes, carbs on carbs! \n\nTheir slice of the day was an Organic zebra eggplant, fried garlic, basil, basil infused olive extra virgin olive oil ($4): http://bit.ly/2p7AXPu. I enjoyed the pizza toppings - there was a good balance of cheese to eggplant and lots of basil for freshness. The fried garlic added a nice crunch. My only gripe was the bottom crust was extra crunchy. I like crunchy but it may have been left a little bit too long in the oven to reheat. But, it was just $4 and it was a healthy slice so I can overlook it.\n\nI also ordered the Spaghetti al Sugo, LoCoco's meatball (Lunch - $12.50): http://bit.ly/2p7PAlJ which was hearty and delicious (I'm excited to eat the leftovers for lunch today). The spaghetti was perfectly al-dente with a good bite and sugo had the perfect mild acidity. The meatball was super moist and I was surprised to find currants and pinenuts inside for a pleasant sweetness and texture contrast. There was also green onions in the meatball which was different. Both the white onion and green onions were in larger cuts. I love onions but personally I prefer them in smaller pieces. \n\nService was courteous and prompt which makes it a great lunch spot if you work in the area. While I was sitting at the bar waiting for my order, a homeless man was standing in the doorway looking a bit distressed. One of the owners (?) asked if he was ok and if he needed something. The man asked for a glass of water and he brought him one. I was especially touched that he treated him with respect and just like anyone who would have walked through those doors. He could have easily shoo'd him away so I commend him for being so kind. \n\nPink Onion is a cozy, casual space with a handful of tables, bar seating, and two outdoor tables in front (so you can bring your furry sidekick).  \n\nThe guy next to me ordered a slice a pizza and the panini of the day (pork chop) which was HUGEEE and looked delicious. Besides having some order envy, thank you sir for making me feel less guilty about ordering carbs on carbs!",
  "datePublished": "2017-04-27",
  "ratingValue": 4
}