{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=NPfjXYTpTFOu-x3eBmphOg",
  "author": "Jessica T.",
  "description": "Delicious!\n\nMy boyfriend and I decided to treat ourselves (our bellies) to some delicious food after a long day of rock climbing and walking astound the city. Reviews looked good and their pictures on Yelp and Instagram of the food looked even better!\n\nThe restaurant itself is away from the main road so it's a little quieter and it's also possible to find street parking. My boyfriend and I parked in the Office Max parking lot (although I don't know if we were really allowed to do that... we didn't get a parking ticket or anything though!). Upon entering, we were quickly greeted by the lady and gentleman behind the bar counter. The kind lady offered a small tasting of some liquor which was pretty sweet and definitely a tasty way to start our visit. The walls were beautifully painted and the decorations really added some character. The large windows in the front let in a lot of natural light which was nice and there was a good amount of seated available. We chose to sat at the bar but they had multiple tables inside. It got a little crowded because the resvtaurant was also hosting a party of 12-15 people at the time (so great for parties if you reserve ahead of time). There are also two small tables outside of you prefer the fresh air. \n\nThere was a good variety of food on the menu with a whole separate menu for their alcohol! We decided to share a small pizza and appetizer with wine and beer. Their pizza was delicious. All the ingredients seemed fresh, the amount of cheese and tomato sauce were perfect, and the crust was thoroughly cooked through and also not too thick or thin. There was chili (oil?) that I also drizzled on my pizza for an extra kick. The truffle bruschetta appetizer was a great way to start our meal; the portion was just right for two people to share and the truffle was absolutely delicious. We were even able to taste the beer and wine prior to making a decision which was nice. \n\nI had a wonderful experience. I will definitely be back.\n\n\nUPDATE: 6 months later (2/24/2018)and the food is still super delicious. I'm glad that this place is doing well in regards to business because their food is great. Tried the meatballs today as an appetizer and boy were they tasty. Homemade with a bunch of goodies inside with lots of flavor in a a just as flavorful sauce. The Pink Alarm Fire pizza was delicious especially if you want to add some heat, shared a large with my boyfriend and still brought home three big slices too!",
  "datePublished": "2017-08-21",
  "ratingValue": 5
}