{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=rvCZ4YlDDhWksU5U9liOJw",
  "author": "Kristin A.",
  "description": "Cute little restaurant with great food and service. \n\nWe arrived at 6:30 because we had a reservation and were surprised to see how small and intimate Pink Onion is. Total, I think there were about 9 tables. At the time we arrived, a couple other tables were occupied but the restaurant quickly filled up and by 7:30 or so when we took off there were probably 5 groups waiting for tables. \n\nWe took a look at the menu and ordered the vegetarian burrata ($18) and a large Kanoute pizza ($29). Our server brought over some bread and some great olive oil. The burrata arrived quickly with some arugula, tomatoes, and nuts, but the unexpected surprise were the candied pears and blue berries that added this incredible freshness and unique flair to the salad. It was great. After that, we waited a a little while before realizing the waiter had given our pizza to the table next to ours (they had ordered the same thing but smaller).  To compensate for his small mistake, he gave us these delightful little fruity drinks which were unbelievably refreshing (we asked what they were and the waiter said the chef had just made them for fun today). It was a great mix of chopped strawberries/blueberries/pears inside a drink. They also gave us an extra glass of wine and extra bread/olive oil. \n\nOur pizza came after another 10 minutes or so. I'm not a huge fan of deep dish or thin crust, so I was glad to find the Kanoute pizza was in the middle ground. This whole pizza was amazing. The pesto was absolutely wonderful and the mix of ricotta and mozzarella was great as well. \n\nWe ended up leaving with about half of our large pizza. A small pizza with the burrata salad would have probably been more appropriate for 2 people. Either way, we were glad to have the leftovers because we enjoyed the pizza so much!",
  "datePublished": "2018-07-26",
  "ratingValue": 4
}