{
  "name": "Ffiona’s Restaurant",
  "address": "51 Kensington Church Street, London W8 4BA, United Kingdom",
  "longitude": -0.192783395566043,
  "latitude": 51.50405773515,
  "types": "British",
  "webpage": "ffionas.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/ffionas-restaurant-london",
  "ext_id": "212",
  "rev_url": "https://www.yelp.com/biz/ffionas-restaurant-london?hrid=McjMly_sU-DCLOQCuzdcFg",
  "author": "Scott N.",
  "description": "My wife and I were looking for a special place to eat for our last evening in London. After a number of Yelp reviews and online searches, we narrowed the list of places down to just two. We were staying at the Royal Garden Hotel in Kensington, and wanted something within walking distance. After getting lost, we hailed a Black Cab and said \"please take us to Ffiona's on Church Street. We're starving!\"\n\nFfiona's is one of those little gems that you read about, but rarely have the privilege of actually coming across. The restaurant is small, cozy, and welcoming. We were greeted at the door by a very friendly waitress who showed us to one end of two of their community style dining tables. There are other tables that seat smaller parties but they were full.\n\nAfter ordering our meal, my wife quickly identified the owner, a friendly, affable, take-charge woman who was frequently chatting with a number of the other guests, many of whom appeared to be neighborhood regulars.\n\nThe meal itself was excellent. I had the Scottish Sirloin Steak with Garlic Mashed Potatoes and roasted carrots. Exactly the type of no-nonsense meal that I was looking for. My wife ordered the Scallops and thoroughly enjoyed them.\n\nDuring our meal, Ffiona came by our table to check on us, which gave my wife, who also owns a restaurant in Los Angeles, an opportunity to strike up a conversation. They ended up chatting for 20 minutes about the restaurant business. We feel like we've made a new friend.\n\nAll in all, we had a fantastic experience. The atmosphere was cozy, the owner and staff were friendly and attentive, the prices were very reasonable, and the value was over the top. Our favorite meal of our entire trip.\n\nWe will definitely be back on our next trip to the UK!",
  "datePublished": "2018-06-24",
  "ratingValue": 5
}