{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=GlomJ_Etd8qTtpM0K4iXgA",
  "author": "Kristin Y.",
  "description": "I appreciate more than ever that this place isn't trying to be some overtly trendy fancy hipster spot - which really seems to be the new San Francisco way, unfortunately. This new trend over the years has made me feel like my home, San Francisco, is losing its charm. However, it was with extreme happiness the Pink Onion did not have this feel. It is cozy, comfortably decorated, and has that warm intimate and friendly ambience I feel most San Franciscans are really missing these days. The staff and vibe is cool and relaxed which makes it all the more awesome as a place you'd wanna hit up regularly. It's a place I'd wanna have a gathering with friends, a date with my partner, or even just a chill dinner solo at the counter. There is also outdoor seating which is clutch for those perfect blue sky SF days! \n\nThe food. Omg! The. FOOD! I've been a New Yorker now for seven years and I'd say it's really tough to impress me with pizza. I mean.. come on, I'm a New Yorker!! But good lord their pizza was legit! I'd say easily my favorite pizza I've had in SF! We ordered quite a bit of food and there wasn't one item that I thought \"eh\" about! Each thing we ordered seemed to be better than the next! For the sake of your eyes and time I will reference only a handful of items.\n\nFirst, the Bruschetta Olib. Def not your tradition bruschetta when you think of bruschetta. It was done with a soft goat cheese, arugula, prosciutto and ours was served with strawberries instead of fig. I don't think I ever would've thought to add strawberries or something sweet like that but it was perfection! I honestly could've stopped eating everything else and just ordered more of that! Although I'm really glad I didn't! We ordered several pastas all of which were delicious! The pasta wasn't too soft or too firm and all of them were incredibly flavorful. We also ordered several pizzas. Hands down my favorite was The Kanoute! I love when fresh arugula is on a pizza! Like all the other food we had, the pizza was not lacking in any flavor! From the ingredients to the crust, it was clear the Pink Onion knew what they were doing when they made their pizza! It was also real pizza! As another reviewer stated it wasn't this thin crust coal fired pizza. Just good ol' fashioned pizza - the stuff New Yorkers love! And of course, it's not a trip to an Italian styled restaurant without finishing off with some tiramisu! It was light, fluffy, and not overly sweet! Pretty sure it only lasted about two minutes on the table - and I feel I am being overly gracious with my estimate of time. \n\nI would also be amiss if I did not comment on their selection of beers and wines on tap! I've eaten my way through too many cities and sometimes find places put a lot of thought into the food but forget the beverage pairings. I did not feel this at the Pink Onion! They appeared to have actually taken the time to consider the beers and wines they chose to serve with their food and the selection was on point! \n\nOverall, the Pink Onion is nothing less than a five star. From the staff that continuously laughed and had smiles on their faces to the food that made me stuff myself to the point of rolling out the door - it was all amazing! This will def be on my list for every visit back home! Bravo Pink Onion. Bravo!",
  "datePublished": "2017-04-27",
  "ratingValue": 5
}