{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=Yal1OVPwjfojq_Zc9KPqag",
  "author": "Mike L.",
  "description": "After yet another failed attempt to finally try Farmhouse Thai (this time, we got our reservation wrong), my friends and I found ourselves dejected and hungry.  So thank goodness for Pink Onion and the last minute reservation they still had free!  Especially after hearing from my buddy (and Yelp friend Cherylynn N.) how good this place was; I may not have known much about them before coming here, but I was super stoked by the time we walked through the door!\n\nAt a glance, Pink Onion is easy to overlook.  Not only is it on a relatively quiet block without a lot of frontage, but it's fairly modest in size, with about a half dozen tables inside, a coupe more out front, and some bar seating.  Yet, that cozy feel only adds to the allure of its low-key and casual vibe.  Well, that and their awesome eats.  The menu doesn't have a wide range of stuff (appetizers, salad, pasta, and pizzas), but within those, they do have some great offerings (including a dozen types of pizzas!).\n\n-- UMBRIAN BLACK TRUFFLE BRUSCHETTA - 3 Pcs of Bruschetta with Ricotta Cheese, Parmesan, Cracked Black Pepper, and Shaved Umbrian Summer Truffle with Extra Virgin Olive Oil...$11\n(https://www.yelp.com/biz_photos/pink-onion-san-francisco?select=M-M8aSzN3QlTiohTYTy6XA)\nFirst off, plus points for giving us an extra piece for free so that the four of us wouldn't have to share.  That might not have gone well given how good this was!  The bread had a decent crust, but the toppings was where it was at - healthy amount of ricotta, just the right amount of pepper, and all those delicious shavings of truffle.  Yum!\n\n-- PINK ONION'S MARGHERITA - San Marzano Tomatoes, Basil, Fresh Mozzarella...$27 (large)\n(https://www.yelp.com/biz_photos/pink-onion-san-francisco?select=-W2-HKmqkKDQhnyB8_4-3Q)\nMargherita pies aren't normally my first pick, but this was great (and perfect for my vegetarian friend).  While others I've had in the past were heavy on the tomato, this had just the right amount.  What's more, I love how they didn't skimp out on the mozzarella either!\n\n-- TYSON PUNCH OUT - Sausage, Mushroom, Ricotta, Green Onion...$27 (large)\n(https://www.yelp.com/biz_photos/pink-onion-san-francisco?select=XNAo5kLEMMB1gNUBRijg5g)\nLike with the bruschetta, the toppings on this were terrific!  While it was a little heavy on the mushrooms (even for me), the mix of flavors complemented each other really well.  I especially liked the sausage and the ricotta (loved that creamy element).  So, so good!\n\nFor both pizzas, I thought the crusts/dough were spot on.  Soft and moist, slightly salted, and not super burnt on the edges.  Plus, it wasn't overly thick or thin, which can always be an issue.\n\nBeyond the food, everything else during our time here was rock solid.  The entire staff was great and snagging a table for four on a Wednesday night would've been a breeze even if we didn't have a reservation (which I'd still recommend, just in case).  All in all, FOUR AND A HALF STARS would be right, but I'm rounding down for now.  While I have zero complaints about the food, or much of anything else, I thought this was more great than mind blowing.  I'll definitely be back!",
  "datePublished": "2017-10-22",
  "ratingValue": 4
}