{
  "name": "Pink Onion",
  "address": "64 14th St, San Francisco, CA 94103",
  "longitude": -122.4148932,
  "latitude": 37.7687832,
  "types": "Pizza|Italian|Gastropubs",
  "webpage": "pinkonionpizza.com",
  "price_range": 2,
  "restaurant_url": "https://www.yelp.com/biz/pink-onion-san-francisco",
  "rev_url": "https://www.yelp.com/biz/pink-onion-san-francisco?hrid=nGix5sXdRDxEW8RUXVwZYg",
  "author": "Cindy Z.",
  "description": "I met with the boyfriend here for our Friday date night. I arrived a bit early and waited outside. The server was thoughtful and came out to ask if I wanted any water or drinks while waiting.\n\nOnce the both of us were there, we were seated at a table in front of the window. In the next 15 minutes, we went from being the second table to be seated to a full house. At the same time, we never received even a menu during this time. I failed with many attempts trying to flag down the only waiter in the restaurant until a customer sitting nearby finally helped me get the waiter's attention. We were honestly getting so frustrated at this point to get any attention and almost walked out, but the waiter finally came around and apologized. He made it up by giving us each a glass of complimentary wine and explaining how this table was a new setup, so he was not used to serving this table. At least service improved after that and we got our orders down.\n\nWe ordered the Side Meatballs ($11) and Small U'sfincione ($21). My favorite thing about Italian places is the complimentary bread they usually start you off with. Their bread is incredibly soft and warm, which was so perfect with the olive oil --yum! I seriously couldn't get enough of it and even got another plate of them to also go with our meatballs. This plate comes with two large meatballs that's stuffed with pinenuts. The hefty balls of meat was good and resembled something more like a meatloaf. This was pretty tasty and a good starter with meat to counter our non-meat pizza.\n\nThe U'sfincione is a Sicilian specialty pizza stuffed with carmalized onions, pinenuts, currants, mozzarella, and breadcrumbs. This is not your typical pizza though. It's flavorful, cheesy, and a nice crunchy texture from the pinenuts and breadcrumbs. Definitely a unique try, although the boyfriend was more in favor of the regular pizzas. In the end, we only finished half of it and took the rest home.\n\nGood ol' authentic pizzas here, but they could definitely add another waiter for service. Expect a lot of people coming in and out of here from Caviar, Postmates, Grubhub, and other food delivery services.",
  "datePublished": "2018-03-20",
  "ratingValue": 4
}